porous3/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.05;

vertices
(
    (.5 -1 -.5)
    (.5 1 -.5)
    (-.5 1 -.5)
    (-.5 -1 -.5)
    (.5 -1 .5)
    (.5 1 .5)
    (-.5 1 .5)
    (-.5 -1 .5)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 5 5) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inletWalls
    {
        type wall;
        faces
        (
          (0 4 7 3)

        );
    }
    outletWalls
    {
        type wall;
        faces
        (
            (2 6 5 1)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
